plerup/easy_nrf52/src/lib/enrf.c
  if (m_app_evt_cb) {
    m_app_evt_cb(p_ble_evt, p_context);
  }
}

//--------------------------------------------------------------------------

static void ble_stack_init(void) {
  ret_code_t err_code;

  err_code = nrf_sdh_enable_request();
  APP_ERROR_CHECK(err_code);

  // Configure the BLE stack using the default settings.
  // Fetch the start address of the application RAM.
  uint32_t ram_start = 0;
  err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
  APP_ERROR_CHECK(err_code);

  // Enable BLE stack.
  err_code = nrf_sdh_ble_enable(&ram_start);
  APP_ERROR_CHECK(err_code);

  // Register a handler for BLE events.
  NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}

//--------------------------------------------------------------------------

static void gatt_evt_handler(nrf_ble_gatt_t *p_gatt, nrf_ble_gatt_evt_t const *p_evt) {
  if ((m_conn_handle == p_evt->conn_handle) && (p_evt->evt_id == NRF_BLE_GATT_EVT_ATT_MTU_UPDATED)) {
    m_ble_nus_max_data_len = p_evt->params.att_mtu_effective - OPCODE_LENGTH - HANDLE_LENGTH;
    NRF_LOG_DEBUG("Data len is set to 0x%X(%d)", m_ble_nus_max_data_len, m_ble_nus_max_data_len);
  }
  NRF_LOG_DEBUG("ATT MTU exchange completed. central 0x%x peripheral 0x%x",
                p_gatt->att_mtu_desired_central,
                p_gatt->att_mtu_desired_periph);
}

//--------------------------------------------------------------------------

static void gatt_init(void) {
  ret_code_t err_code;
  err_code = nrf_ble_gatt_init(&m_gatt, gatt_evt_handler);
  APP_ERROR_CHECK(err_code);
  err_code = nrf_ble_gatt_att_mtu_periph_set(&m_gatt, NRF_SDH_BLE_GATT_MAX_MTU_SIZE);
  APP_ERROR_CHECK(err_code);
}

//--------------------------------------------------------------------------

static void log_init(void) {
  ret_code_t err_code = NRF_LOG_INIT(NULL);
  APP_ERROR_CHECK(err_code);
  NRF_LOG_DEFAULT_BACKENDS_INIT();
}

//--------------------------------------------------------------------------

static void power_management_init(void) {
  ret_code_t err_code;
  err_code = nrf_pwr_mgmt_init();
  APP_ERROR_CHECK(err_code);
}

//--------------------------------------------------------------------------

static void db_disc_handler(ble_db_discovery_evt_t *p_evt) {
  if (m_nus_c_rx_cb) {
    ble_nus_c_on_db_disc_evt(&m_ble_nus_c, p_evt);
  }
  if (m_disc_cb) {
    m_disc_cb(p_evt);
  }
}
//--------------------------------------------------------------------------

void enrf_set_phy(bool long_range) {
  m_long_range = long_range;
}

//--------------------------------------------------------------------------

void enrf_set_tx_power(int tx_power) {
  m_tx_power = MAX(-40, MIN(8, tx_power));
}

//--------------------------------------------------------------------------

ret_code_t enrf_set_device_name(const char *dev_name) {
  ble_gap_conn_sec_mode_t sec_mode;
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);
  return sd_ble_gap_device_name_set(&sec_mode,
                                    (const uint8_t *)dev_name,
                                    strlen(dev_name));


}

//--------------------------------------------------------------------------

ret_code_t enrf_start_advertise(bool connectable,
                                uint16_t company_id, ble_advdata_name_type_t type,
                                uint8_t *p_data, uint8_t size,
                                uint32_t interval_ms, uint32_t timeout_s,
                                nus_rx_cb_t nus_cb) {
  return enrf_start_advertise_ex(connectable, company_id, type, p_data, size,  NULL, 0,
                                 interval_ms, timeout_s, nus_cb);
}

//--------------------------------------------------------------------------

ret_code_t enrf_start_advertise_ex(bool connectable,
                                   uint16_t company_id,
                                   ble_advdata_name_type_t type,
                                   uint8_t *p_manuf_data, uint8_t manuf_data_size,
                                   ble_uuid_t *p_uuids, uint8_t uuid_cnt,
                                   uint32_t interval_ms, uint32_t timeout_s,
                                   nus_rx_cb_t nus_cb) {
  ret_code_t err_code;
  ble_advdata_t advdata;
  ble_advdata_t srdata;

  if (((p_manuf_data == NULL) && (manuf_data_size > 0)) ||
      ((p_uuids == NULL) && (uuid_cnt > 0))) {
    return NRF_ERROR_NULL;
  }
  enrf_stop_advertise(m_adv_handle);
  m_app_nus_rec_cb = nus_cb;

  // Set advertisement data
  memset(&advdata, 0, sizeof(advdata));
  memset(&srdata, 0, sizeof(srdata));

  advdata.name_type = type;
  advdata.flags = connectable ?
                  BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE :
                  BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;

  // Manufacturer data
  if ((p_manuf_data != NULL) && (manuf_data_size > 0)) {
    static ble_advdata_manuf_data_t manuf_specific_data;
    manuf_specific_data.company_identifier = company_id;
    manuf_specific_data.data.p_data = p_manuf_data;
    manuf_specific_data.data.size = manuf_data_size;
    advdata.p_manuf_specific_data = &manuf_specific_data;
  }

  /*
   * Long-range advertising is non-scannable, so UUIDs must be included
   * in the primary extended advertising data. For normal advertising,
   * place UUIDs in the scan response to preserve space for the name and
   * manufacturer data in the primary advertisement.
   */
  if ((p_uuids != NULL) && (uuid_cnt > 0)) {
    if (m_long_range) {
      advdata.uuids_complete.uuid_cnt = uuid_cnt;
      advdata.uuids_complete.p_uuids = p_uuids;
    } else {
      srdata.uuids_complete.uuid_cnt = uuid_cnt;
      srdata.uuids_complete.p_uuids = p_uuids;
    }
  }
  m_adv_data.adv_data.p_data = m_enc_advdata;
  m_adv_data.adv_data.len =
    MIN(sizeof(m_enc_advdata),
        m_long_range ? ENRF_ADV_DATA_SIZE_MAX
        : BLE_GAP_ADV_SET_DATA_SIZE_MAX);
  m_adv_data.scan_rsp_data.p_data = NULL;
  m_adv_data.scan_rsp_data.len = 0;

  // Set advertisement parameters
  memset(&m_adv_params, 0, sizeof(m_adv_params));
  if (m_long_range) {
    m_adv_params.properties.type =
      connectable ?
      BLE_GAP_ADV_TYPE_EXTENDED_CONNECTABLE_NONSCANNABLE_UNDIRECTED :
      BLE_GAP_ADV_TYPE_EXTENDED_NONCONNECTABLE_NONSCANNABLE_UNDIRECTED;
    m_adv_params.primary_phy = BLE_GAP_PHY_CODED;
    m_adv_params.secondary_phy = BLE_GAP_PHY_CODED;
  } else {
    m_adv_params.properties.type =
      connectable ?
      BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED :
      BLE_GAP_ADV_TYPE_NONCONNECTABLE_SCANNABLE_UNDIRECTED;
    m_adv_params.primary_phy = BLE_GAP_PHY_1MBPS;
    m_adv_params.secondary_phy = BLE_GAP_PHY_1MBPS;
  }

  m_adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
  m_adv_params.interval = MSEC_TO_UNITS(interval_ms, UNIT_0_625_MS);
  m_adv_params.duration = timeout_s * 100; // In 10 ms units
  err_code = ble_advdata_encode(&advdata,
                                m_adv_data.adv_data.p_data,
                                &m_adv_data.adv_data.len);
  if (err_code != NRF_SUCCESS) {
    return err_code;
  }

  if (!m_long_range && (p_uuids != NULL) && (uuid_cnt > 0)) {
    m_adv_data.scan_rsp_data.p_data = m_enc_scan_rsp_data;
    m_adv_data.scan_rsp_data.len = MIN(sizeof(m_enc_scan_rsp_data), BLE_GAP_ADV_SET_DATA_SIZE_MAX);
    err_code = ble_advdata_encode(&srdata,
                                  m_adv_data.scan_rsp_data.p_data,
                                  &m_adv_data.scan_rsp_data.len);
    if (err_code != NRF_SUCCESS) {
      return err_code;
    }
  }

  err_code = sd_ble_gap_adv_set_configure(&m_adv_handle,
                                          &m_adv_data,
                                          &m_adv_params);
  if (err_code != NRF_SUCCESS) {
    return err_code;
  }

  // And transmission output power
  err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV,
                                     m_adv_handle,
                                     m_tx_power);
  if (err_code != NRF_SUCCESS) {
    return err_code;
  }

  m_is_central = false;

  NRF_LOG_DEBUG("Advertising set, lr: %d, tx: %d dBm", m_long_range, m_tx_power);
  err_code = sd_ble_gap_adv_start(m_adv_handle, APP_BLE_CONN_CFG_TAG);
  m_is_advertising = err_code == NRF_SUCCESS;

  return err_code;
}

