plerup/easy_nrf52/src/lib/enrf.c
//--------------------------------------------------------------------------

ret_code_t enrf_disconnect() {
  return sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
}

//--------------------------------------------------------------------------

bool enrf_disconnect_wait(uint32_t timeout_s) {
  enrf_disconnect();
  // Wait for disconnection
  uint32_t cnt = 0;
  while (enrf_is_connected() && (cnt < timeout_s * 10)) {
    enrf_delay_ms(100);
  }
  return !enrf_is_connected();
}

//--------------------------------------------------------------------------

ret_code_t enrf_enable_char_notif(uint16_t cccd_handle, bool enable) {
  uint8_t buf[BLE_CCCD_VALUE_LEN];
  buf[0] = enable ? BLE_GATT_HVX_NOTIFICATION | BLE_GATT_HVX_INDICATION : 0;
  buf[1] = 0;
  const ble_gattc_write_params_t write_params = {
    .write_op = BLE_GATT_OP_WRITE_REQ,
    .flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
    .handle = cccd_handle,
    .offset = 0,
    .len = sizeof(buf),
    .p_value = buf
  };
  return sd_ble_gattc_write(m_conn_handle, &write_params);
}

//--------------------------------------------------------------------------

ret_code_t enrf_write_char(uint8_t op, uint16_t char_handle, uint8_t *data, uint16_t length) {
  const ble_gattc_write_params_t write_params = {
    .write_op = op,
    .flags = BLE_GATT_EXEC_WRITE_FLAG_PREPARED_WRITE,
    .handle = char_handle,
    .offset = 0,
    .len = length,
    .p_value = data
  };
  return sd_ble_gattc_write(m_conn_handle, &write_params);
}

//--------------------------------------------------------------------------

ret_code_t enrf_read_char(uint16_t char_handle) {
  return sd_ble_gattc_read(m_conn_handle, char_handle, 0);
}

//--------------------------------------------------------------------------

ret_code_t enrf_nus_c_data_send(const uint8_t *data, uint32_t length) {
  return ble_nus_c_string_send(&m_ble_nus_c, (uint8_t *)data, length);
}

//--------------------------------------------------------------------------

ret_code_t enrf_nus_c_string_send(const char *str) {
  return enrf_nus_c_data_send((const uint8_t *)str, strlen(str));
}

//--------------------------------------------------------------------------

void enrf_wait_for_event() {
#ifdef ENRF_SERIAL_USB
  while (app_usbd_event_queue_process());
#endif
  if (m_restart) {
    enrf_restart(m_restart == 2);
  }
  if (NRF_LOG_PROCESS() == false) {
    nrf_pwr_mgmt_run();
  }
}

//--------------------------------------------------------------------------

void enrf_restart(bool enter_dfu) {
  NRF_LOG_INFO("Restarting: %d", enter_dfu);
  if (enter_dfu) {
    sd_power_gpregret_clr(0, 0xffffffff);
    sd_power_gpregret_set(0, 0xB1);
  }
  if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
    sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
  }
  NRF_LOG_PROCESS();
  nrf_delay_ms(1000);
  NVIC_SystemReset();
}

//--------------------------------------------------------------------------

ret_code_t enrf_uuid_from_string(const char *uuid, ble_uuid_t *p_uuid) {
  ble_uuid128_t base_uuid;
  const char *s = uuid;
  int ind = 15;

  if ((uuid == NULL) || (p_uuid == NULL)) {
    return NRF_ERROR_NULL;
  }

  // Read UUID hex values and store them in little-endian order
  while (*s != '\0') {
    uint8_t high;
    uint8_t low;
    if (*s == '-') {
      s++;
      continue;
    }
    if ((ind < 0) || (s[1] == '\0')) {
      return NRF_ERROR_INVALID_PARAM;
    }
    high = _hex_val(s[0]);
    low = _hex_val(s[1]);
    if ((high > 0x0f) || (low > 0x0f)) {
      return NRF_ERROR_INVALID_PARAM;
    }
    base_uuid.uuid128[ind--] = (high << 4) | low;
    s += 2;
  }
  if (ind != -1) {
    return NRF_ERROR_INVALID_PARAM;
  }

  // Extract the variable 16-bit part of the UUID
  p_uuid->uuid = ((uint16_t)base_uuid.uuid128[13] << 8) |
                 base_uuid.uuid128[12];

  // Register only the vendor-specific base UUID
  base_uuid.uuid128[12] = 0;
  base_uuid.uuid128[13] = 0;

  return sd_ble_uuid_vs_add(&base_uuid, &p_uuid->type);
}
//--------------------------------------------------------------------------

ret_code_t enrf_add_uuid(const char *uuid) {
  ret_code_t res;
  ble_uuid_t service_uuid;
  res = enrf_uuid_from_string(uuid, &service_uuid);
  if (res == NRF_SUCCESS) {
    res = ble_db_discovery_evt_register(&service_uuid);
  }
  return res;
}

//--------------------------------------------------------------------------

const char *enrf_addr_to_str(ble_gap_addr_t *gap_addr) {
  static char addr[18];
  addr[0] = 0;
  snprintf(addr, sizeof(addr),
           "%02X:%02X:%02X:%02X:%02X:%02X",
           gap_addr->addr[5],
           gap_addr->addr[4],
           gap_addr->addr[3],
           gap_addr->addr[2],
           gap_addr->addr[1],
           gap_addr->addr[0]);
  return addr;
}

//--------------------------------------------------------------------------

bool enrf_str_to_addr(const char *addr_str, ble_gap_addr_t *gap_addr) {
  int x[6];
  int cnt = sscanf(addr_str, "%X:%X:%X:%X:%X:%X", &x[5], &x[4], &x[3], &x[2], &x[1], &x[0]);
  for (int i = 0; i < cnt; i++) {
    gap_addr->addr[i] = x[i];
  }
  return cnt == 6;
}

//--------------------------------------------------------------------------

const char *enrf_get_device_address() {
  ble_gap_addr_t ble_gap_addr;
  if (sd_ble_gap_addr_get(&ble_gap_addr) == NRF_SUCCESS) {
    return enrf_addr_to_str(&ble_gap_addr);
  } else {
    return "?";
  }
}

//--------------------------------------------------------------------------

uint32_t hex_to_bytes(const char *str, uint8_t *bytes, uint32_t max_len) {
  uint32_t len = MIN(strlen(str) / 2, max_len);
  for (uint32_t i = 0; i < len; i++) {
    uint8_t val = _hex_val(*str++);
    if (val > 15) {
      return 0;
    }
    *bytes = val << 4;
    val = _hex_val(*str++);
    if (val > 15) {
      return 0;
    }
    *bytes += val;
    bytes++;
  }
  return len;
}

//--------------------------------------------------------------------------

void bytes_to_hex(uint8_t *bytes, uint32_t len, char *str) {
  for (uint32_t i = 0; i < len; i++) {
    uint8_t val = bytes[i];
    *(str++) = _hex_char(val >> 4);
    *(str++) = _hex_char(val & 0xF);
  }
  *str = 0;
}

