plerup/easy_nrf52/src/lib/enrf.c
//--------------------------------------------------------------------------

#if defined(ENRF_SERIAL_USB) || defined(ENRF_SERIAL_UART)

#define READ_BUFF_SIZE 255

static bool m_input_available = false;
static size_t m_input_pos = 0;
static char m_input_buffer[READ_BUFF_SIZE];
static serial_read_callback_t m_read_cb = NULL;

void enrf_set_serial_read_callback(serial_read_callback_t cb) {
  m_read_cb = cb;
}

//--------------------------------------------------------------------------

size_t enrf_serial_read(char *str, size_t max_length) {
  if (!m_input_available) {
    return 0;
  }
  size_t len = MIN(max_length - 1, m_input_pos);
  strncpy(str, m_input_buffer, len);
  str[len] = 0;
  m_input_pos = 0;
  m_input_available = false;
  return len;
}

#endif

#ifdef ENRF_SERIAL_USB

#define CDC_ACM_COMM_INTERFACE 0
#define CDC_ACM_COMM_EPIN NRF_DRV_USBD_EPIN2

#define CDC_ACM_DATA_INTERFACE 1
#define CDC_ACM_DATA_EPIN NRF_DRV_USBD_EPIN1
#define CDC_ACM_DATA_EPOUT NRF_DRV_USBD_EPOUT1

#define READ_SIZE 1

static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const *p_inst,
                                    app_usbd_cdc_acm_user_event_t event);
static void usbd_user_ev_handler(app_usbd_event_type_t event);

static bool m_acm_connected = false;

static volatile bool m_acm_tx_done = false;

APP_USBD_CDC_ACM_GLOBAL_DEF(m_app_cdc_acm,
                            cdc_acm_user_ev_handler,
                            CDC_ACM_COMM_INTERFACE,
                            CDC_ACM_DATA_INTERFACE,
                            CDC_ACM_COMM_EPIN,
                            CDC_ACM_DATA_EPIN,
                            CDC_ACM_DATA_EPOUT,
                            APP_USBD_CDC_COMM_PROTOCOL_NONE);

static const app_usbd_config_t m_usbd_config = {.ev_state_proc = usbd_user_ev_handler};

static void cdc_acm_user_ev_handler(app_usbd_class_inst_t const *p_inst,
                                    app_usbd_cdc_acm_user_event_t event) {
  static char rx_buffer[READ_SIZE];

  switch (event) {
    case APP_USBD_CDC_ACM_USER_EVT_PORT_OPEN: {
      // Setup first transfer
      app_usbd_cdc_acm_read(&m_app_cdc_acm, rx_buffer, READ_SIZE);
      m_acm_connected = true;
      break;
    }
    case APP_USBD_CDC_ACM_USER_EVT_PORT_CLOSE:
      m_acm_connected = false;
      break;
    case APP_USBD_CDC_ACM_USER_EVT_TX_DONE:
      m_acm_tx_done = true;
      break;
    case APP_USBD_CDC_ACM_USER_EVT_RX_DONE: {
      if (m_read_cb) {
        do {
          m_read_cb(rx_buffer[0]);
        } while (app_usbd_cdc_acm_read(&m_app_cdc_acm, rx_buffer, READ_SIZE) == NRF_SUCCESS);
      } else {
        ret_code_t ret;
        do {
          if (!m_input_available && rx_buffer[0] != '\r') {
            m_input_buffer[m_input_pos++] = rx_buffer[0];
            if (rx_buffer[0] == '\n' || m_input_pos >= READ_BUFF_SIZE) {
              m_input_available = true;
            }
          }
          // Fetch data until internal buffer is empty
          ret = app_usbd_cdc_acm_read(&m_app_cdc_acm, rx_buffer, READ_SIZE);
        } while (ret == NRF_SUCCESS);
      }
      break;
    }
    default:
      break;
  }
}

//--------------------------------------------------------------------------

static void usbd_user_ev_handler(app_usbd_event_type_t event) {
  switch (event) {
    case APP_USBD_EVT_DRV_SUSPEND:
      break;
    case APP_USBD_EVT_DRV_RESUME:
      break;
    case APP_USBD_EVT_STARTED:
      break;
    case APP_USBD_EVT_STOPPED:
      app_usbd_disable();
      bsp_board_leds_off();
      break;
    case APP_USBD_EVT_POWER_DETECTED:
      NRF_LOG_INFO("USB power detected");
      if (!nrf_drv_usbd_is_enabled()) {
        app_usbd_enable();
      }
      break;
    case APP_USBD_EVT_POWER_REMOVED:
      NRF_LOG_INFO("USB power removed");
      app_usbd_stop();
      break;
    case APP_USBD_EVT_POWER_READY:
      NRF_LOG_INFO("USB ready");
      app_usbd_start();
      break;
    default:
      break;
  }
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_enable(bool on) {
  if (!on) {
    return NRF_ERROR_API_NOT_IMPLEMENTED;
  }
  m_serial_active = true;
  return NRF_SUCCESS;
}

//--------------------------------------------------------------------------

#define MILLIS (uint32_t)((uint64_t)NRF_RTC0->COUNTER * 1000 / APP_TIMER_CLOCK_FREQ)

ret_code_t enrf_serial_write_data(const uint8_t *data, size_t len) {
  ret_code_t res = NRF_SUCCESS;
  if (m_serial_active && m_acm_connected) {
    m_acm_tx_done = false;
    do {
      res = app_usbd_cdc_acm_write(&m_app_cdc_acm, data, len);
      app_usbd_event_queue_process();
    } while (res == NRF_ERROR_BUSY);
    uint32_t start = MILLIS;
    while (!m_acm_tx_done) {
      app_usbd_event_queue_process();
      if ((MILLIS - start) > 1000) {
        // APP_USBD_CDC_ACM_USER_EVT_TX_DONE seems not to be delivered sometimes.
        // Avoid lockup here
        break;
      }
    }
  }
  return res;
}
//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  return enrf_serial_write_data((const uint8_t *)str, strlen(str));
}

//--------------------------------------------------------------------------

bool enrf_acm_connected() {
  return m_acm_connected;
}

#elif defined(ENRF_SERIAL_UART)

#define UART_TX_BUF_SIZE 256
#define UART_RX_BUF_SIZE 256

static void uart_event_handler(app_uart_evt_t *p_event) {
  uint8_t ch;
  switch (p_event->evt_type) {
    case APP_UART_DATA_READY:
      app_uart_get(&ch);
      if (!m_input_available && ch != '\r') {
        m_input_buffer[m_input_pos++] = ch;
        if (ch == '\n' || m_input_pos >= READ_BUFF_SIZE) {
          m_input_available = true;
        }
      }
      break;

    default:
      break;
  }
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_enable(bool on) {
  uint32_t err_code = NRF_SUCCESS;
  if (on != m_serial_active) {
    if (on) {
      app_uart_comm_params_t comm_params;
      comm_params.rx_pin_no = RX_PIN_NUMBER;
      comm_params.tx_pin_no = TX_PIN_NUMBER;
      comm_params.flow_control = APP_UART_FLOW_CONTROL_DISABLED;
      comm_params.use_parity = false;
      comm_params.baud_rate = UART_BAUD_RATE;

      APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_event_handler,
                         APP_IRQ_PRIORITY_LOWEST,
                         err_code);
    } else {
      nrf_delay_ms(250);
      err_code = app_uart_close();
    }
    m_serial_active = on;
  }
  return err_code;
}

