plerup/easy_nrf52/src/lib/enrf.c
//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  ret_code_t err_code = NRF_SUCCESS;
  if (m_serial_active) {
    for (size_t i = 0; i < strlen(str) && err_code == NRF_SUCCESS; i++) {
      err_code = app_uart_put(str[i]);
    }
  }

  return err_code;
}

//--------------------------------------------------------------------------

#else

ret_code_t enrf_serial_enable(bool on) {
  m_serial_active = on;
  return NRF_SUCCESS;
}

//--------------------------------------------------------------------------

ret_code_t enrf_serial_write(const char *str) {
  return NRF_ERROR_API_NOT_IMPLEMENTED;
}

//--------------------------------------------------------------------------

size_t enrf_serial_read(char *str, size_t max_length) {
  return 0;
}

#endif

static bool delay_timeout = false;
static void delay_timeout_proc(void *p_context) {
  delay_timeout = true;
}

void enrf_delay_ms(uint32_t ms) {
  static bool initated = false;
  APP_TIMER_DEF(id);
  if (!initated) {
    app_timer_create(&id, APP_TIMER_MODE_SINGLE_SHOT, delay_timeout_proc);
    initated = true;
  }
  delay_timeout = false;
  app_timer_start(id, APP_TIMER_TICKS(ms), NULL);
  while (!delay_timeout) {
    enrf_wait_for_event();
  }
}

//--------------------------------------------------------------------------

uint32_t enrf_millis() {
  return (uint32_t)((uint64_t)NRF_RTC0->COUNTER * 1000 / APP_TIMER_CLOCK_FREQ);
}

//--------------------------------------------------------------------------

bool enrf_init(const char *dev_name, nrf_sdh_ble_evt_handler_t ble_evt_cb) {
  ret_code_t err_code;
  bool do_log = true;
#ifdef ENRF_ENABLE_LOG_PIN
  // Log control pin defined, must be low for log to be enabled
  nrf_gpio_cfg_input(ENRF_ENABLE_LOG_PIN, NRF_GPIO_PIN_PULLUP);
  nrf_delay_ms(1);
  do_log = nrf_gpio_pin_read(ENRF_ENABLE_LOG_PIN) == 0;
  nrf_gpio_cfg_default(ENRF_ENABLE_LOG_PIN);
#endif
  if (do_log) {
    log_init();
  }
#if BLE_DFU_ENABLED == 1
  err_code = ble_dfu_buttonless_async_svci_init();
  APP_ERROR_CHECK(err_code);
#endif
  timers_init();

#ifdef ENRF_SERIAL_USB
  app_usbd_serial_num_generate();
  err_code = app_usbd_init(&m_usbd_config);
  APP_ERROR_CHECK(err_code);
  app_usbd_class_inst_t const *class_cdc_acm = app_usbd_cdc_acm_class_inst_get(&m_app_cdc_acm);
  err_code = app_usbd_class_append(class_cdc_acm);
  APP_ERROR_CHECK(err_code);
  err_code = app_usbd_power_events_enable();
  APP_ERROR_CHECK(err_code);
#endif

  power_management_init();
  ble_stack_init();
  gap_params_init();
  gatt_init();
  services_init();
  conn_params_init();
  enrf_set_device_name(dev_name);
#if SDK_VERSION >= 17
  ble_db_discovery_init_t db_init;
  memset(&db_init, 0, sizeof(ble_db_discovery_init_t));
  db_init.evt_handler = db_disc_handler;
  db_init.p_gatt_queue = &m_ble_gatt_queue;
  err_code = ble_db_discovery_init(&db_init);
#else
  err_code = ble_db_discovery_init(db_disc_handler);
#endif
  APP_ERROR_CHECK(err_code);

  m_app_evt_cb = ble_evt_cb;

  NRF_LOG_INFO("%s, version: %s %s", dev_name, _build_version, _build_time);
  NRF_LOG_INFO("Mac address: %s", enrf_get_device_address());

  return true;
}
